[
  {
    "title": "Gol Maal",
    "content": "A 1979 Hindi-language comedy film directed by Hrishikesh Mukherjee, revolving around a man's escalating web of lies to secure and maintain his job.",
    "categories": "",
    "status": "publish",
    "acf_fields": {
      "language": "Hindi",
      "year": "1979",
      "imdb_rating": "8.5",
      "critic_rating": "Critically acclaimed for its humor, performances, and direction.",
      "post_summary": "Ramprasad, a young man, fabricates a twin brother to appease his orthodox boss, leading to a series of comedic situations.",
      "director": "Hrishikesh Mukherjee",
      "writer": "Story: Sailesh Dey; Screenplay: Sachin Bhowmick; Dialogues: Rahi Masoom Raza",
      "music": "R. D. Burman",
      "produced_by": "N. C. Sippy",
      "stars": "Amol Palekar, Utpal Dutt, Bindiya Goswami, Dina Pathak, Deven Verma",
      "watch_now": "Availability varies; please check local streaming platforms.",
      "trailer": "https://www.youtube.com/watch?v=example_trailer_link",
      "budget_details": "Not Available",
      "box_office": "Not Available",
      "Tagline": "A comedy of errors that tickles the funny bone.",
      "movietitle": "Gol Maal",
      "regions_availability": "India",
      "awards_&_nominations": "Filmfare Awards: Best Actor (Amol Palekar), Best Comedian (Utpal Dutt), Best Lyricist (Gulzar for 'Aanewala Pal'), Best Supporting Actress (Dina Pathak, Nominated)",
      "cinematography": "Jaywant Pathare",
      "editor": "Kamal Saigal",
      "releasedate": "April 20, 1979",
      "production_house": "Rupam Chitra",
      "run_time": "144 minutes",
      "list_of_platform_availability_": "Availability varies; please check local streaming platforms.",
      "seo_search_question_1": "What is the plot of Gol Maal?",
      "seo_search_answer_1": "Gol Maal follows Ramprasad, who creates a fictional twin to keep his job, leading to humorous complications.",
      "seo_search_question_2": "Who directed Gol Maal?",
      "seo_search_answer_2": "The film was directed by Hrishikesh Mukherjee.",
      "seo_search_question_3": "Where can I watch Gol Maal?",
      "seo_search_answer_3": "Availability varies; please check local streaming platforms.",
      "review_highlights": "Gol Maal is celebrated for its witty script and outstanding performances, making it a timeless classic in Indian cinema."
    }
  },
  {
    "title": "The World of Apu",
    "content": "The final installment of Satyajit Ray's acclaimed Apu Trilogy, 'The World of Apu' follows Apu, an unemployed graduate with aspirations of becoming a writer. His life takes an unexpected turn when he is persuaded to marry a stranger, leading to profound personal transformations.",
    "categories": "",
    "status": "publish",
    "acf_fields": {
      "language": "Bengali",
      "year": "1959",
      "imdb_rating": "8.5",
      "critic_rating": "Critically acclaimed for its storytelling, performances, and direction.",
      "post_summary": "Apu, an aspiring writer, becomes entangled in an unforeseen marriage that alters the course of his life, exploring themes of love, loss, and redemption.",
      "director": "Satyajit Ray",
      "writer": "Satyajit Ray",
      "music": "Ravi Shankar",
      "produced_by": "Satyajit Ray",
      "stars": "Soumitra Chatterjee, Sharmila Tagore, Alok Chakravarty, Swapan Mukherjee",
      "watch_now": "Availability varies; please check local streaming platforms.",
      "trailer": "https://www.youtube.com/watch?v=example_trailer_link",
      "budget_details": "Not Available",
      "box_office": "Not Available",
      "Tagline": "A journey of love, loss, and self-discovery.",
      "movietitle": "The World of Apu",
      "regions_availability": "India",
      "awards_&_nominations": "National Film Award for Best Feature Film (India), Sutherland Award for Best Original and Imaginative Film (BFI), National Board of Review Award for Best Foreign Language Film (USA)",
      "cinematography": "Subrata Mitra",
      "editor": "Dulal Dutta",
      "releasedate": "May 1, 1959",
      "production_house": "Satyajit Ray Productions",
      "run_time": "107 minutes",
      "list_of_platform_availability_": "Availability varies; please check local streaming platforms.",
      "seo_search_question_1": "What is the plot of The World of Apu?",
      "seo_search_answer_1": "The World of Apu follows Apu, an unemployed graduate aspiring to be a writer, whose life changes dramatically after an unexpected marriage, leading him through experiences of love, loss, and personal growth.",
      "seo_search_question_2": "Who directed The World of Apu?",
      "seo_search_answer_2": "The film was directed by Satyajit Ray.",
      "seo_search_question_3": "Where can I watch The World of Apu?",
      "seo_search_answer_3": "Availability varies; please check local streaming platforms.",
      "review_highlights": "The World of Apu is celebrated for its emotional depth, masterful direction, and poignant performances, solidifying its place as a classic in world cinema."
    }
  },
  {
    "title": "3 Idiots",
    "content": "A 2009 Indian Hindi-language coming-of-age comedy-drama film that follows the journey of three engineering students navigating the pressures of academic life, friendship, and personal aspirations.",
    "categories": "",
    "status": "publish",
    "acf_fields": {
      "language": "Hindi",
      "year": "2009",
      "imdb_rating": "8.4",
      "critic_rating": "Critically acclaimed for its storytelling, performances, and social commentary.",
      "post_summary": "The film explores the lives of three engineering students at the Imperial College of Engineering, highlighting their struggles with the rigid education system and their quest for self-discovery.",
      "director": "Rajkumar Hirani",
      "writer": "Rajkumar Hirani, Abhijat Joshi",
      "music": "Shantanu Moitra",
      "produced_by": "Vidhu Vinod Chopra",
      "stars": "Aamir Khan, R. Madhavan, Sharman Joshi, Kareena Kapoor, Boman Irani, Omi Vaidya",
      "watch_now": "Availability varies; please check local streaming platforms.",
      "trailer": "https://www.youtube.com/watch?v=xvszmNXdM4w",
      "budget_details": "₹55 crore",
      "box_office": "All Time Blockbuster",
      "Tagline": "Don't be stupid. Be an I.D.I.O.T.",
      "movietitle": "3 Idiots",
      "regions_availability": "India",
      "awards_&_nominations": "Filmfare Awards: Best Film, Best Director, Best Screenplay, Best Dialogue, Best Supporting Actor (Boman Irani), Best Male Playback Singer (Shaan); National Film Awards: Best Popular Film Providing Wholesome Entertainment, Best Lyrics (Swanand Kirkire), Best Audiography; IIFA Awards: Best Film, Best Director, Best Actor (Aamir Khan), Best Supporting Actor (Sharman Joshi), Best Screenplay, Best Dialogue, Best Music Director (Shantanu Moitra), Best Lyricist (Swanand Kirkire), Best Male Playback Singer (Shaan)",
      "cinematography": "C. K. Muraleedharan",
      "editor": "Rajkumar Hirani",
      "releasedate": "25 December 2009",
      "production_house": "Vinod Chopra Films",
      "run_time": "170 minutes",
      "list_of_platform_availability_": "Availability varies; please check local streaming platforms.",
      "seo_search_question_1": "What is the plot of 3 Idiots?",
      "seo_search_answer_1": "3 Idiots follows the lives of three engineering students as they navigate the challenges of academic pressure, personal aspirations, and the rigid education system in India.",
      "seo_search_question_2": "Who directed 3 Idiots?",
      "seo_search_answer_2": "The film was directed by Rajkumar Hirani.",
      "seo_search_question_3": "Where can I watch 3 Idiots?",
      "seo_search_answer_3": "Availability varies; please check local streaming platforms.",
      "review_highlights": "3 Idiots is celebrated for its engaging narrative, strong performances, and its critique of the traditional education system, making it a beloved classic in Indian cinema."
    }
  },
  {
    "title": "Manichitrathazhu",
    "content": "A 1993 Malayalam-language psychological horror thriller that follows Ganga, a newlywed woman who begins to exhibit strange behaviors after moving into her husband's ancestral mansion, leading to a series of mysterious events.",
    "categories": "",
    "status": "publish",
    "acf_fields": {
      "language": "Malayalam",
      "year": "1993",
      "imdb_rating": "8.7",
      "critic_rating": "Critically acclaimed for its storytelling, performances, and direction.",
      "post_summary": "Ganga, after moving into her husband's ancestral home, starts experiencing supernatural occurrences, leading to revelations about her psychological state and the mansion's dark history.",
      "director": "Fazil",
      "writer": "Madhu Muttam",
      "music": "M. G. Radhakrishnan (songs), Johnson (background score)",
      "produced_by": "Swargachitra Appachan",
      "stars": "Shobana, Mohanlal, Suresh Gopi, Vinaya Prasad, Innocent, K. P. A. C. Lalitha, Nedumudi Venu, Sudheesh, Thilakan",
      "watch_now": "Availability varies; please check local streaming platforms.",
      "trailer": "https://www.youtube.com/watch?v=example_trailer_link",
      "budget_details": "Not Available",
      "box_office": "Highest-grossing Malayalam film at the time of release; re-released in 2024 with significant box office success.",
      "Tagline": "A haunting tale of the mind and the mansion.",
      "movietitle": "Manichitrathazhu",
      "regions_availability": "India",
      "awards_&_nominations": "National Film Awards: Best Popular Film Providing Wholesome Entertainment, Best Actress (Shobana); Kerala State Film Awards: Best Film with Popular Appeal and Aesthetic Value, Best Actress (Shobana), Best Makeup Artist (P. N. Mani); Kerala Film Critics Association Awards: Best Actor (Suresh Gopi), Best Actress (Shobana), Best Music Director (M. G. Radhakrishnan), Special Jury Award (Fazil)",
      "cinematography": "Venu, Anandakuttan, Sunny Joseph",
      "editor": "T. R. Shekhar",
      "releasedate": "25 December 1993",
      "production_house": "Swargachitra",
      "run_time": "169 minutes",
      "list_of_platform_availability_": "Availability varies; please check local streaming platforms.",
      "seo_search_question_1": "What is the plot of Manichitrathazhu?",
      "seo_search_answer_1": "Manichitrathazhu follows Ganga, who, after moving into her husband's ancestral mansion, begins to experience supernatural events, leading to revelations about her psychological state and the mansion's history.",
      "seo_search_question_2": "Who directed Manichitrathazhu?",
      "seo_search_answer_2": "The film was directed by Fazil.",
      "seo_search_question_3": "Where can I watch Manichitrathazhu?",
      "seo_search_answer_3": "Availability varies; please check local streaming platforms.",
      "review_highlights": "Manichitrathazhu is celebrated for its masterful blend of psychological horror and drama, with Shobana's award-winning performance and Fazil's direction making it a landmark film in Indian cinema."
    }
  },
  {
    "title": "Charlie",
    "content": "A 2015 Malayalam-language adventure drama film that follows Tessa, a young woman who embarks on a journey to find the elusive artist Charlie, whose sketchbook she discovers in her rented room.",
    "categories": "",
    "status": "publish",
    "acf_fields": {
      "language": "Malayalam",
      "year": "2015",
      "imdb_rating": "8.0",
      "critic_rating": "Critically acclaimed for its storytelling, performances, and direction.",
      "post_summary": "Tessa, after discovering a sketchbook left behind by the previous tenant, becomes intrigued by the mysterious artist Charlie. Her quest to find him leads her through a series of adventures, unveiling stories of love, compassion, and freedom.",
      "director": "Martin Prakkat",
      "writer": "Martin Prakkat, Unni R.",
      "music": "Gopi Sundar",
      "produced_by": "Martin Prakkat, Joju George, Shebin Becker",
      "stars": "Dulquer Salmaan, Parvathy Thiruvothu, Aparna Gopinath, Nedumudi Venu, Chemban Vinod Jose, Kalpana",
      "watch_now": "Availability varies; please check local streaming platforms.",
      "trailer": "https://www.youtube.com/watch?v=example_trailer_link",
      "budget_details": "Not Available",
      "box_office": "Grossed ₹42 crore worldwide",
      "Tagline": "A journey of love, art, and self-discovery.",
      "movietitle": "Charlie",
      "regions_availability": "India",
      "awards_&_nominations": "Kerala State Film Awards: Best Actor (Dulquer Salmaan), Best Actress (Parvathy Thiruvothu), Best Director (Martin Prakkat), Best Cinematography (Jomon T. John); Asianet Film Awards: Best Actress (Parvathy Thiruvothu), Best Supporting Actress (Kalpana); IIFA Utsavam: Best Director (Martin Prakkat), Best Story (Unni R.), Best Actor (Dulquer Salmaan), Best Supporting Actress (Aparna Gopinath), Best Performance in a Comic Role (Soubin Shahir), Best Music Director (Gopi Sundar), Best Lyricist (Santhosh Varma for 'Chundari Penne')",
      "cinematography": "Jomon T. John",
      "editor": "Shameer Muhammed",
      "releasedate": "24 December 2015",
      "production_house": "Finding Cinema",
      "run_time": "135 minutes",
      "list_of_platform_availability_": "Availability varies; please check local streaming platforms.",
      "seo_search_question_1": "What is the plot of Charlie?",
      "seo_search_answer_1": "Charlie follows Tessa, who discovers a sketchbook left by the previous tenant in her rented room. Intrigued by the artwork and stories, she sets out to find the mysterious artist Charlie, leading her on an adventurous journey filled with love and self-discovery.",
      "seo_search_question_2": "Who directed Charlie?",
      "seo_search_answer_2": "The film was directed by Martin Prakkat.",
      "seo_search_question_3": "Where can I watch Charlie?",
      "seo_search_answer_3": "Availability varies; please check local streaming platforms.",
      "review_highlights": "Charlie is celebrated for its whimsical storytelling, vibrant visuals, and compelling performances, making it a standout film in Malayalam cinema."
    }
  }
]
